[{"title":"“大二里，我的选择”","date":"2017-03-08T04:24:08.000Z","path":"2017/03/08/大二里，我的选择/","text":"三月了，很多人在准备着考研复试，也有很多人，刚刚走上了考研之路。我经常问我的直系：“学长，我觉得自己挺努力的，但学习的时候还是老走神，怎么办？”“胜利在即，你应该再努力点。”想起了之前在网上看过的一句话，努力和拼尽全力的区别就是，你努力的时候，会觉得自己拼尽全力了；但当你真正拼尽全力的时候，你会觉得自己不够努力。当我们在努力做一件事情的时候，常常容易被自己感动，觉得自己很累很苦，顾影自怜，甚至觉得自己是世界上最努力的人，恨不得分分钟找人分享自己的苦难史。但事实是，我们想得到自己想要的东西，想过上自己向往的生活，努力是应该的，没有什么值得炫耀的。而且，当你不够强大，不够优秀时，你的抱怨，你的苦难，真的没有多少人在乎。从大三后半学期开始，很多人纠结，到底是考研还是工作？考研有意义，还是工作更好点？其实我个人认为，考研和工作，是两条路，路本身没有对错，是否有意义，主要看走路的人和行走的过程。在大学，成熟，也要趁早。想清楚自己想要什么，不想要什么，这样你的选择会更有方向性。不要经常用“我还是一个学生”来迷惑自己，你成年了，要为自己的未来负责。人生的十字路口，你的选择，直接决定了你今后的生活。而我，当初毅然决然地选择了考研。02是的，现在，早上六点半，正在学校图书馆的原因。其实当时很多人是反对的。宿舍六个人，一开始，就只有我一个人考研；家人觉得回老家找个安稳工作就可以了，不用再冒险考研；而很多朋友也劝我，学文学出来不好找工作，还是直接工作吧……我从小就是一个被放养的孩子，就是天王老子的建议，在我看来，顶多也就算一个建议。没有人，可以决定我的人生，除非我自己。我没有问意义，因为我知道，我们不能用现在的眼光来估量未来的价值。我不害怕失败，我已经失败够多了，失败让我成长。其实失败本身不可怕，最可悲的是，还没开始自己就怂了。多年后想想，其实我本可以的，多么痛的领悟。我也不在乎别人的眼光，因为我知道自己是真正喜欢文学的。那些喜欢站在一边说风凉话的人，第一，他们和我的人生无关；第二，他们中的很多人，都是害怕努力了会失败，根本不敢尝试的人。我只问了自己一个问题：“如果不考研，将来，我会后悔吗？”会！因为我是真的热爱文学。不论贫穷或富贵，某一天当我想起时，我会感到无限悲哀：我本可以！03其实之前，我也不知道研究生的生活怎么样，不了解文艺学的课程设置，考研，全凭着一腔热血。大学时，我是一个纯正的学渣，不在乎学分，不喜欢的课，从来不上，大多数时间，都用来做自己喜欢的事情了。其实我个人认为很正常，把大学看成游乐园，交了门票之后，我只是选择了自己喜欢的项目。大学是提升自己的地方，整天跟着别人人云亦云，做自己不喜欢，没有任何提高的事情，我一天也受不了。当然，在身边人普遍比较规矩的情况下，我一直都显得特立独行。所以，很多人刚来读研时，都适应不了，但我，第一天就适应了。我想干嘛就干嘛，上课，读书，写作，锻炼，玩耍，吹牛逼，一样都没有落下。当然，我不是一个好学生，即使上了研究生，还是会逃课的。选择读研，我只是选择了一种生活方式，在同龄人都努力工作，在社会中竞争厮杀的时候，我也不愿意，在学校中当一只小绵羊。有很多压力，但我的思维习惯是活在当下，每天都是最宝贵的一天，做自己喜欢的事情，尽自己最大的努力生活。每一天，都充实，且完满。我每天七点之前起床，晚上十二点睡觉，不打游戏不追剧，但我还是觉得时间不够用。偶尔会觉得累，但更多时候都很开心，我目前过着自己喜欢的生活，也正在努力，希望未来也过上自己想要的生活，成为自己希望成为的那种人。04很多人问我：“你毕业以后要做什么工作？”我喜欢实话实说：“想过很多，但还是看到时候的机遇和情况吧。”没有必要假设，更没有必要解释，未来还没有来，世界一直在变化，我能做的，就是努力培养自己的核心能力，踏踏实实努力。未来，从来都是走出来的，不是想出来的。如果可以，我希望正在读文的你，可以和我一起努力，一起成长，一起拥抱，属于我们各自的未来。05 我觉得，有时候，他们做的太少，想的太多。路就摆在那里，怎么走，走得怎么样，从来，和路无关，只和人有关。 做选择时，要跟着自己的心，考虑自己的实际情况，不要人云亦云。 做了选择后，就要对自己的行为负责，尽最大努力，过好属于自己的生活。 努力，无非是想过上自己真正喜欢的生活。","tags":[{"name":"日记","slug":"日记","permalink":"http://yoursite.com/tags/日记/"}]},{"title":"“我的第一个Blog”","date":"2017-03-01T13:17:41.000Z","path":"2017/03/01/“我的第一个Blog”/","text":"谢谢大家，","tags":[]}]